package com.company;

import java.util.HashMap;

public class DataStructure<S, S1> extends HashMap {
   // ყველა თანამედროვე პროგრამულ ენას აქვს დაიმპლემენტირებული რაიმე სახის მონაცემთა სტრუქტურა,
   // რომელიც ახდენს და ამარტივებს მონაცემების ჩასმას/წაშლას/ჩასწორებას O(1) დროში.
   // JavaScript - Object/JSON, Python - Dictionary, Java - HashMap
   // იქიდან გამომდინარე, რომ Java-ში უკვე არსებობს მოცემული ამოცანის ამოსახსნელად არსებული მონაცემთა სტრუქტურა
   // მარტივად ჩემი მონაცემთა სტრუქტურა გავხადე ამ კლასის შვილობილი.

}
